# Простые задачки (для новичков, необязательно для выполнения):

# Напишите программу, которая считает площадь прямоугольника, спрашивая у пользователя длину двух сторон
a = int(input('Введите длинну первой сторны прямоугольника: '))
b = int(input('Введите длинну второй сторны прямоугольника: '))
s = print(a * b)
# Напишите программу, которая спрашивает у пользователя два числа и знак: "+" или "-". 
# В зависимости от знака выводит их сумму или разницу

# Напишите программу, которая находит все простые числа между 0 и пользовательским числом

# Напишите программу, которая выводит все кратные 5 числа между двумя пользовательскими числами

